Terraform plan for __ibo__
<details>
<summary>Plan: 50 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_dns_record_set.inventory_postgres_a_record will be created
  + resource "google_dns_record_set" "inventory_postgres_a_record" {
      + id           = (known after apply)
      + managed_zone = "ibo-prod-private-dns-managed-zone"
      + name         = "ibo.postgres.commerce.internal."
      + project      = "ibo-prod"
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

  # kubernetes_secret.inventory_app_secret will be created
  + resource "kubernetes_secret" "inventory_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "inventory-db-secrets"
          + namespace        = "inventory"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.invoice_app_secret will be created
  + resource "kubernetes_secret" "invoice_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "invoice-db-secrets"
          + namespace        = "invoice"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.logistics_app_secret will be created
  + resource "kubernetes_secret" "logistics_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "logistics-db-secrets"
          + namespace        = "logistics-service"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.nodemaster_app_secret will be created
  + resource "kubernetes_secret" "nodemaster_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "nodemaster-db-secrets"
          + namespace        = "node-master"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.ord_app_secret will be created
  + resource "kubernetes_secret" "ord_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "oo-db-secrets"
          + namespace        = "order-orchestration"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.orderservice_app_secret will be created
  + resource "kubernetes_secret" "orderservice_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "orderservice-db-secrets"
          + namespace        = "order-service"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.payment_app_secret will be created
  + resource "kubernetes_secret" "payment_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "payment-db-secrets"
          + namespace        = "payment"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.tax_app_secret will be created
  + resource "kubernetes_secret" "tax_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "tax-db-secrets"
          + namespace        = "tax"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.inventory_postgres_name_postfix will be created
  + resource "random_id" "inventory_postgres_name_postfix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_string.dev_team_db_password will be created
  + resource "random_string" "dev_team_db_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.inventory_app_user_name will be created
  + resource "random_string" "inventory_app_user_name" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.inventory_app_user_password will be created
  + resource "random_string" "inventory_app_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.inventory_password will be created
  + resource "random_string" "inventory_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.invoice_user_password will be created
  + resource "random_string" "invoice_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.logistics_user_password will be created
  + resource "random_string" "logistics_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.nodemaster_user_password will be created
  + resource "random_string" "nodemaster_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.ord_orchestrator_user_password will be created
  + resource "random_string" "ord_orchestrator_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.orderservice_user_password will be created
  + resource "random_string" "orderservice_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.payment_user_password will be created
  + resource "random_string" "payment_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.tax_user_password will be created
  + resource "random_string" "tax_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["invoice"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "invoice"
      + project   = "ibo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["logistics"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "logistics"
      + project   = "ibo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["nodemaster"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "nodemaster"
      + project   = "ibo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["order-orchestration"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "order-orchestration"
      + project   = "ibo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["orderservice"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "orderservice"
      + project   = "ibo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["payment"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "payment"
      + project   = "ibo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["tax"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "tax"
      + project   = "ibo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.default[0] will be created
  + resource "google_sql_database" "default" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "inventory"
      + project   = "ibo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_13"
      + deletion_protection           = false
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = "ibo-prod"
      + public_ip_address             = (known after apply)
      + region                        = "asia-south1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = "ALWAYS"
          + authorized_gae_applications = (known after apply)
          + availability_type           = "REGIONAL"
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 20
          + disk_type                   = "PD_SSD"
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-custom-4-15360"
          + user_labels                 = {
              + "env"     = "prod"
              + "project" = "ibo-prod"
            }
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = false
              + enabled                        = true
              + point_in_time_recovery_enabled = false
              + start_time                     = "22:00"
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = 30
                  + retention_unit   = "COUNT"
                }
            }

          + database_flags {
              + name  = "autovacuum_analyze_scale_factor"
              + value = "0"
            }
          + database_flags {
              + name  = "autovacuum_analyze_threshold"
              + value = "5000"
            }
          + database_flags {
              + name  = "autovacuum_naptime"
              + value = "15"
            }
          + database_flags {
              + name  = "autovacuum_max_workers"
              + value = "6"
            }
          + database_flags {
              + name  = "autovacuum_vacuum_cost_delay"
              + value = "10"
            }
          + database_flags {
              + name  = "autovacuum_vacuum_cost_limit"
              + value = "1000"
            }
          + database_flags {
              + name  = "autovacuum_vacuum_threshold"
              + value = "5000"
            }
          + database_flags {
              + name  = "autovacuum_vacuum_scale_factor"
              + value = "0"
            }
          + database_flags {
              + name  = "log_autovacuum_min_duration"
              + value = "0"
            }
          + database_flags {
              + name  = "autovacuum"
              + value = "on"
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/ibo-prod/global/networks/ibo-prod-network"
              + require_ssl     = false
            }

          + location_preference {
              + zone = "asia-south1-a"
            }

          + maintenance_window {
              + day          = 1
              + hour         = 23
              + update_track = "stable"
            }
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
          + update = "15m"
        }
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["dev-read-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "dev-read-user"
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["invoice-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "invoice-user"
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["logistics-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "logistics-user"
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["nodemaster-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "nodemaster-user"
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["ord-orchestrator-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "ord-orchestrator-user"
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["orderservice-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "orderservice-user"
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["payment-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "payment-user"
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["tax-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "tax-user"
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.default[0] will be created
  + resource "google_sql_user" "default" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = (known after apply)
      + password = (sensitive value)
      + project  = "ibo-prod"
    }

  # module.inventory_google_postgres.null_resource.module_depends_on will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "0"
        }
    }

  # module.inventory_google_postgres.random_id.additional_passwords["dev-read-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.additional_passwords["invoice-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.additional_passwords["logistics-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.additional_passwords["nodemaster-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.additional_passwords["ord-orchestrator-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.additional_passwords["orderservice-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.additional_passwords["payment-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.additional_passwords["tax-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.suffix[0] will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.inventory_google_postgres.random_id.user-password will be created
  + resource "random_id" "user-password" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

Plan: 50 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [Terraform #304](https://github.com/ebomart/commerce-infrastructure/actions/runs/1402447752)